; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	thermograph0 - mode
	infrared1 - mode
	GroundStation0 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	GroundStation7 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star4 - direction
	Star9 - direction
	GroundStation2 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation8)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(pointing satellite1 GroundStation2)
	(have_image Phenomenon10 thermograph0)
	(have_image Planet11 infrared1)
	(have_image Planet12 thermograph0)
	(have_image Phenomenon13 thermograph0)
	(have_image Star14 infrared1)
))

)

; plan
1. (turn_to satellite0 groundstation8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation8)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation8)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 phenomenon13 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 7
5. (take_image satellite0 phenomenon13 instrument0 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 1 of 7
6. (turn_to satellite0 phenomenon10 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon10)
   goals met: 1 of 7
7. (take_image satellite0 phenomenon10 instrument0 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 2 of 7
8. (turn_to satellite0 planet11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet11)
   goals met: 2 of 7
9. (take_image satellite0 planet11 instrument0 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 3 of 7
10. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 3 of 7
11. (take_image satellite0 planet12 instrument0 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 4 of 7
12. (turn_to satellite0 star14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star14)
   goals met: 4 of 7
13. (take_image satellite0 star14 instrument0 infrared1)
   added: (have_image star14 infrared1)
   goals met: 5 of 7
14. (turn_to satellite0 groundstation6 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation6)
   goals met: 6 of 7
15. (turn_to satellite1 groundstation2 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 groundstation2)
   goals met: 7 of 7
